# магазин телефонов, в начале вы приветсвуете покупателя и
# просите ввести его имя, после этого “имя” + товары которые
# у нас есть, спрашиваете показать каталог или найти товар по
# характеристике, показываете каталог товаров, ещё сделать поиск по цене
# после этого просите его вводить характеристики телефона: (name, memory, color),
# если такого товара нет
# извиняетесь и просите выбрать другой товар, если есть такой телефон вы
# сообщаете цену, и спрашиваете “вы готовы купить” пользовтель вводит да или нет,
# если да то вы берете от него деньги, пользователь вводит сумму, если пользовтель
# ввёл недостаточно денег сообщаете что нужно доплатить, если пользователь ввёл больше
# денег даёте сдачу, если он ввел ровную сумму поздравляете с покупкой если нет вы предлагаете
# выбрать другой телефон


from phone_store import PHONES
from phone import search_by_props, search_by_price


print("Здраствуйте!")
customer = input("Как вас зовут?:")
print(customer, 'Добро пожаловать')
print("это все что у нас есть:", PHONES)


while True:
    nk = input('Если хотите посмотреть каталог введите "1":  \n'
               "Eсли хотите найти товар по характеристики введите '2':  \n"
               "Если хотите поиск по цене введите '3':  \n")

    if nk == "1":
        print(PHONES)

    elif nk == "2":
        name = input("Выберите модель: ")
        memory = int(input("Укажите объем памяти:"))
        color = input("Какой цвет: ")

        search_by_props(name,memory,color)
    elif nk == "3":
        search_by_price()